---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.AssemblyFailures.NoElementsLeftInExistingAssembly
source: html/30e11590-a233-79e6-c636-15fc64944dc8.htm
---
# Autodesk.Revit.DB.BuiltInFailures.AssemblyFailures.NoElementsLeftInExistingAssembly Property

There are no elements left in the assembly. It will be disassembled.

## Syntax (C#)
```csharp
public static FailureDefinitionId NoElementsLeftInExistingAssembly { get; }
```